package org.example;

public class StaticNonStatic {
    //სტატიკური ცვლადი
    int age;
    static String courseName = "ავტომატიზაციის ";  // ეს არის ყველა ობიექტისთვის საერთო, ამიტომ სტატიკურს ვხდით და პირდაპირ ვიყენებთ ყველა ობიექტისთვის სხვა კლასში, ყოველ ჯერზე მნიშვნელობის მინიჭების გარეშე.
    String name;

     // სტატიკური მეთოდის       მეინში გამოსაძახებლად ობიექტის შექმნა არ არის საჭირო ხოლო არასტატიკურისთვის საჭიროა, რადგან სტატიკური კლასსი ცხოვრობს, არასტატიკური ობიექტში.
     // სტატიკურია ეს
    static  void StaticPrintName(String name){

        System.out.println("შენი სახელია  " + name + "რომელიც სტატიკური მეთოდით დავბეჭდე");
    };
    //ეს უკვე არასტატიკური მეთოდია და ვბეჭდავ ობიექტის გამოყენებით სხვა კლასში
    void  NonStaticPrintName(String name){
        System.out.println("შენი სახელია  " + name + "რომელიც არასტატიკური მეთოდით დავბეჭდე, კლასში ობიექტის შექმნით");
    }
}
