package org.example;
   // ეს არის მშობელი კლასი, რაც ამან იცის ამისმა შვილმა და შვილიშვილმა კლასებმაც იციან. ვიყენებთ იმმისთვის რომ რაც ამისთვის და ამისი შვილებისთვის საერთოა აქ დავწეროთ და რაც განსხვავდება უკვე მის შვილებში
public class Students {
int  age;
String name;
String CourseName(){  // აქ შევქმენი რადგან ამას დავაააფდეითებთ უკვე შვილ კლასში და ისე გადააკეთებს როგორც აწყობს
    return ("გააჩნია ავტომატიზაციის მოსწავლეა თუ მანუალია");
    // ამ მეთოდის სახელი უნდა ერქვას შვილებსაც, იგივე სტრინგს უნდა აბრუნებდდეს და ერთი რაოდენობის პარამეტრები უნდა ჰქონდეთ
};
 // ამ კლასის ყველა შვილისთვის საერთოა სტუდენტის სახელიც, გვარიც ასაკიც ანუ ყველას ახასიათებს ეგენი, მაგრამ განსხვავდებიან კურსით,
}
